zjuwuyu/nuc970_drv/uboot_test/copy2uboot/wuyu_nuc970.h
/**************************************************************************//**
 * @file     nuc970.h
 * @version  V1.00
 * $Revision: 30 $
 * $Date: 15/06/12 2:51p $
 * @brief    NUC970 peripheral access layer header file.
 *           This file contains all the peripheral register's definitions
 *           and memory mapping for NuMicro NUC970 MCU.
 *
 * @note
 * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
/**
   \mainpage NuMicro NUC970 Family Driver Reference Guide
   *
   * <b>Introduction</b>
   *
   * This user manual describes the usage of NUC970 family device driver
   *
   * <b>Disclaimer</b>
   *
   * The Software is furnished "AS IS", without warranty as to performance or results, and
   * the entire risk as to performance or results is assumed by YOU. Nuvoton disclaims all
   * warranties, express, implied or otherwise, with regard to the Software, its use, or
   * operation, including without limitation any and all warranties of merchantability, fitness
   * for a particular purpose, and non-infringement of intellectual property rights.
   *
   * <b>Important Notice</b>
   *
   * Nuvoton Products are neither intended nor warranted for usage in systems or equipment,
   * any malfunction or failure of which may cause loss of human life, bodily injury or severe
   * property damage. Such applications are deemed, "Insecure Usage".
   *
   * Insecure usage includes, but is not limited to: equipment for surgical implementation,
   * atomic energy control instruments, airplane or spaceship instruments, the control or
   * operation of dynamic, brake or safety systems designed for vehicular use, traffic signal
   * instruments, all types of safety devices, and other applications intended to support or
   * sustain life.
   *
   * All Insecure Usage shall be made at customer's risk, and in the event that third parties
   * lay claims to Nuvoton as a result of customer's Insecure Usage, customer shall indemnify
   * the damages and liabilities thus incurred by Nuvoton.
   *
   * Please note that all data and specifications are subject to change without notice. All the
   * trademarks of products and companies mentioned in this document belong to their respective
   * owners.
   *
   * <b>Copyright Notice</b>
   *
   * Copyright (C) 2015 Nuvoton Technology Corp. All rights reserved.
   */
/**
  * \page pg1 Revision History
  *
  * <b>Revision 1.00.000</b>
  * \li Added 2D, CAN, CAP, JPEG, KPI, LCD, NAND, RTC, SC, SCUART drivers and sample codes
  * \li Added USBH UAC class support
  * \li Fixed compilation warnings
  *
  * <b>Revision 0.09.000</b>
  * \li Preliminary release.
*/
#ifndef __NUC970_H__
#define __NUC970_H__

//#include <stdint.h>

/** @addtogroup NUC970_PERIPHERAL_MEM_MAP NUC970 Peripheral Memory Base
  Memory Mapped Structure for NUC970 Peripheral
  @{
 */

/*!< AHB peripherals */
#define    SYS_BA    0xB0000000  /*!< System Global Control */
#define    CLK_BA    0xB0000200  /*!< Clock Control */
#define    EBI_BA    0xB0001000  /*!< EBI Control */
#define    SDIC_BA   0xB0001800  /*!< SDRAM (SDR/DDR/DDR2) Control */
#define    EMC0_BA   0xB0002000  /*!< Ethernet MAC 0 Control */
#define    EMC1_BA   0xB0003000  /*!< Ethernet MAC 1 Control */
#define    GDMA_BA   0xB0004000  /*!< GDMA control */
#define    USBH_BA   0xB0005000  /*!< USB Host EHCI Control */
#define    USBD_BA   0xB0006000  /*!< USB Device Control */
#define    USBO_BA   0xB0007000  /*!< OHCI USB Host Control */
#define    LCM_BA    0xB0008000  /*!< Display, LCM Interface */
#define    ACTL_BA   0xB0009000  /*!< Audio Control */
#define    JPEG_BA   0xB000A000  /*!< JPEG Engine Control */
#define    GE_BA     0xB000B000  /*!< 2-D Graphic Engine */
#define    SDH_BA    0xB000C000  /*!< SD/SDIO Host Controller */
#define    FMI_BA    0xB000D000  /*!< Flash Memory Card Interface */
#define    CAP_BA    0xB000E000  /*!< Sensor (Capture) Interface Control */
#define    CRPT_BA   0xB000F000  /*!< Crypto Engine Control */

/*!< APB peripherals */
#define    UART0_BA  0xB8000000  /*!< UART0 Control */
#define    UART1_BA  0xB8000100  /*!< UART1 Control (High-Speed UART) */
#define    UART2_BA  0xB8000200  /*!< UART2 Control (High-Speed UART) */
#define    UART3_BA  0xB8000300  /*!< UART3 Control  */
#define    UART4_BA  0xB8000400  /*!< UART4 Control (High-Speed UART) */
#define    UART5_BA  0xB8000500  /*!< UART5 Control */
#define    UART6_BA  0xB8000600  /*!< UART6 Control (High-Speed UART) */
#define    UART7_BA  0xB8000700  /*!< UART7 Control */
#define    UART8_BA  0xB8000800  /*!< UART8 Control (High-Speed UART) */
#define    UART9_BA  0xB8000900  /*!< UART9 Control */
#define    UARTA_BA  0xB8000A00  /*!< UARTA Control (High-Speed UART) */
#define    TMR0_BA   0xB8001000  /*!< Timer 0 */
#define    TMR1_BA   0xB8001010  /*!< Timer 1 */
#define    TMR2_BA   0xB8001020  /*!< Timer 2 */
#define    TMR3_BA   0xB8001030  /*!< Timer 3 */
#define    TMR4_BA   0xB8001040  /*!< Timer 4 */
#define    ETMR0_BA  0xB8001400  /*!< Enhanced Timer 0 */
#define    ETMR1_BA  0xB8001500  /*!< Enhanced Timer 1 */
#define    ETMR2_BA  0xB8001600  /*!< Enhanced Timer 2 */
#define    ETMR3_BA  0xB8001700  /*!< Enhanced Timer 3 */
#define    WDT_BA    0xB8001800  /*!< Watch Dog Timer */
#define    WWDT_BA   0xB8001900  /*!< Window Watch Dog Timer */
#define    AIC_BA    0xB8002000  /*!< Interrupt Controller */
#define    GPIO_BA   0xB8003000  /*!< GPIO Control */
#define    RTC_BA    0xB8004000  /*!< Real Time Clock Control */
#define    SC0_BA    0xB8005000  /*!< Smart Card 0 Control */
#define    SC1_BA    0xB8005400  /*!< Smart Card 1 Control */
#define    I2C0_BA   0xB8006000  /*!< I2C 0 Control */
#define    I2C1_BA   0xB8006100  /*!< I2C 1 Control */
#define    SPI0_BA   0xB8006200  /*!< Serial Peripheral Interface 0 */
#define    SPI1_BA   0xB8006300  /*!< Serial Peripheral Interface 1 */
#define    PWM_BA    0xB8007000  /*!< Pulse Width Modulation (PWM) Control */
#define    KPI_BA    0xB8008000  /*!< Keypad Interface Control */
#define    ADC_BA    0xB800A000  /*!< ADC Control */
#define    CAN0_BA   0xB800B000  /*!< CAN 0 Control */
#define    CAN1_BA   0xB800B400  /*!< CAN 1 Control */
#define    MTP_BA    0xB800C000  /*!< MTP Control */

/*@}*/ /* end of group NUC970_PERIPHERAL_MEM_MAP */

/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/
/** @addtogroup NUC970_Peripherals NUC970 Control Register
  NUC970 Device Specific Peripheral registers structures
  @{
*/

/*---------------------- System Manger Controller -------------------------*/
/**
    @addtogroup SYS System Manger Controller(SYS)
    Memory Mapped Structure for SYS Controller
@{ */

#define    REG_SYS_PDID         (SYS_BA+0x000)  /*!< Product Identifier Register */
#define    REG_SYS_PWRON        (SYS_BA+0x004)  /*!< Power-On Setting Register */
#define    REG_SYS_ARBCON       (SYS_BA+0x008)  /*!< Arbitration Control Register */
#define    REG_SYS_LVRDCR       (SYS_BA+0x020)  /*!< Low Voltage Reset & Detect Control Register */
#define    REG_SYS_MISCFCR      (SYS_BA+0x030)  /*!< Miscellaneous Function Control Register */
#define    REG_SYS_MISCIER      (SYS_BA+0x040)  /*!< Miscellaneous Interrupt Enable Register */
#define    REG_SYS_MISCISR      (SYS_BA+0x044)  /*!< Miscellaneous Interrupt Status Register */
#define    REG_SYS_WKUPSER      (SYS_BA+0x058)  /*!< System Wakeup Source Enable Register */
#define    REG_SYS_WKUPSSR      (SYS_BA+0x05C)  /*!< System Wakeup Source Status Register */
#define    REG_SYS_AHBIPRST     (SYS_BA+0x060)  /*!< AHB IP Reset Control Register */
#define    REG_SYS_APBIPRST0    (SYS_BA+0x064)  /*!< APB IP Reset Control Register 0 */
#define    REG_SYS_APBIPRST1    (SYS_BA+0x068)  /*!< APB IP Reset Control Register 1 */
#define    REG_SYS_RSTSTS       (SYS_BA+0x06C)  /*!< Reset Source Active Status Register */
#define    REG_SYS_GPA_MFPL     (SYS_BA+0x070)  /*!< GPIOA Low Byte Multiple Function Control Register */
#define    REG_SYS_GPA_MFPH     (SYS_BA+0x074)  /*!< GPIOA High Byte Multiple Function Control Register */
#define    REG_SYS_GPB_MFPL     (SYS_BA+0x078)  /*!< GPIOB Low Byte Multiple Function Control Register */
#define    REG_SYS_GPB_MFPH     (SYS_BA+0x07C)  /*!< GPIOB High Byte Multiple Function Control Register */
#define    REG_SYS_GPC_MFPL     (SYS_BA+0x080)  /*!< GPIOC Low Byte Multiple Function Control Register */
#define    REG_SYS_GPC_MFPH     (SYS_BA+0x084)  /*!< GPIOC High Byte Multiple Function Control Register */
#define    REG_SYS_GPD_MFPL     (SYS_BA+0x088)  /*!< GPIOD Low Byte Multiple Function Control Register */
#define    REG_SYS_GPD_MFPH     (SYS_BA+0x08C)  /*!< GPIOD High Byte Multiple Function Control Register */
#define    REG_SYS_GPE_MFPL     (SYS_BA+0x090)  /*!< GPIOE Low Byte Multiple Function Control Register */
#define    REG_SYS_GPE_MFPH     (SYS_BA+0x094)  /*!< GPIOE High Byte Multiple Function Control Register */
#define    REG_SYS_GPF_MFPL     (SYS_BA+0x098)  /*!< GPIOF Low Byte Multiple Function Control Register */
#define    REG_SYS_GPF_MFPH     (SYS_BA+0x09C)  /*!< GPIOF High Byte Multiple Function Control Register */
#define    REG_SYS_GPG_MFPL     (SYS_BA+0x0A0)  /*!< GPIOG Low Byte Multiple Function Control Register */
#define    REG_SYS_GPG_MFPH     (SYS_BA+0x0A4)  /*!< GPIOG High Byte Multiple Function Control Register */
#define    REG_SYS_GPH_MFPL     (SYS_BA+0x0A8)  /*!< GPIOH Low Byte Multiple Function Control Register */
#define    REG_SYS_GPH_MFPH     (SYS_BA+0x0AC)  /*!< GPIOH High Byte Multiple Function Control Register */
#define    REG_SYS_GPI_MFPL     (SYS_BA+0x0B0)  /*!< GPIOI Low Byte Multiple Function Control Register */
#define    REG_SYS_GPI_MFPH     (SYS_BA+0x0B4)  /*!< GPIOI High Byte Multiple Function Control Register */
#define    REG_SYS_GPJ_MFPL     (SYS_BA+0x0B8)  /*!< GPIOJ Low Byte Multiple Function Control Register */
#define    REG_SYS_DDR_DSCTL    (SYS_BA+0x0F0)  /*!< DDR I/O Driving Strength Control Register */
#define    REG_SYS_PORDISCR     (SYS_BA+0x100)  /*!< Power-On-Reset Disable Control Register */
#define    REG_SYS_ICEDBGCR     (SYS_BA+0x104)  /*!< ICE Debug Interface Control Register */
#define    REG_SYS_ERRADDCR     (SYS_BA+0x108)  /*!< Error Response Address Control Regsiter */
#define    REG_SYS_REGWPCTL     (SYS_BA+0x1FC)  /*!< Register Write-Protection Control Register */

