zjuwuyu/nuc970_drv/uboot_test/copy2uboot/wuyu_nuc970.h
/*
    USB 2.0 EHCI Controller Registers
*/
#define     EHCVNR          (USBH_BA+0x000)  /*!< EHCI Version Number Register                    */
#define     EHCSPR          (USBH_BA+0x004)  /*!< EHCI Structural Parameters Register             */
#define     EHCCPR          (USBH_BA+0x008)  /*!< EHCI Capability Parameters Register             */
#define     UCMDR           (USBH_BA+0x020)  /*!< EHCI Version Number Register                    */
#define     USTSR           (USBH_BA+0x024)  /*!< USB Status Register                             */
#define     UIENR           (USBH_BA+0x028)  /*!< USB Interrupt Enable Register                   */
#define     UFINDR          (USBH_BA+0x02C)  /*!< USB Frame Index Register                        */
#define     UPFLBAR         (USBH_BA+0x034)  /*!< USB Periodic Frame List Base Address Register   */
#define     UCALAR          (USBH_BA+0x038)  /*!< USB Current Asynchronous List Address           */
#define     UASSTR          (USBH_BA+0x03C)  /*!< USB Asynchronous Schedule Sleep Timer Register  */
#define     UCFGR           (USBH_BA+0x060)  /*!< USB Configure Flag Register                     */
#define     UPSCR0          (USBH_BA+0x064)  /*!< USB Port 0 Status and Control Register          */
#define     UPSCR1          (USBH_BA+0x068)  /*!< USB Port 1 Status and Control Register          */
#define     UHCBIST         (USBH_BA+0x0C0)  /*!< USB Host Controller BIST Register               */
#define     USBPCR0         (USBH_BA+0x0C4)  /*!< USB PHY 0 Control Register                      */
#define     USBPCR1         (USBH_BA+0x0C8)  /*!< USB PHY 1 Control Register                      */

/*
    USB 1.1 OHCI Controller Registers
*/
#define     HcRev           (USBO_BA+0x000)  /*!< Host Controller Revision Register               */
#define     HcControl       (USBO_BA+0x004)  /*!< Host Controller Control Register                */
#define     HcComSts        (USBO_BA+0x008)  /*!< Host Controller Command Status Register         */
#define     HcIntSts        (USBO_BA+0x00C)  /*!< Host Controller Interrupt Status Register       */
#define     HcIntEn         (USBO_BA+0x010)  /*!< Host Controller Interrupt Enable Register       */
#define     HcIntDis        (USBO_BA+0x014)  /*!< Host Controller Interrupt Disable Register      */
#define     HcHCCA          (USBO_BA+0x018)  /*!< Host Controller Communication Area Register     */
#define     HcPerCED        (USBO_BA+0x01C)  /*!< Host Controller Period Current ED Register      */
#define     HcCtrHED        (USBO_BA+0x020)  /*!< Host Controller Control Head ED Register        */
#define     HcCtrCED        (USBO_BA+0x024)  /*!< Host Controller Control Current ED Register     */
#define     HcBlkHED        (USBO_BA+0x028)  /*!< Host Controller Bulk Head ED Register           */
#define     HcBlkCED        (USBO_BA+0x02C)  /*!< Host Controller Revision Register               */
#define     HcDoneH         (USBO_BA+0x030)  /*!< Host Controller Done Head Register              */
#define     HcFmIntv        (USBO_BA+0x034)  /*!< Host Controller Frame Interval Register         */
#define     HcFmRem         (USBO_BA+0x038)  /*!< Host Controller Frame Remaining Register        */
#define     HcFNum          (USBO_BA+0x03C)  /*!< Host Controller Frame Number Register           */
#define     HcPerSt         (USBO_BA+0x040)  /*!< Host Controller Periodic Start Register         */
#define     HcLSTH          (USBO_BA+0x044)  /*!< Host Controller Low Speed Threshold Register    */
#define     HcRhDeA         (USBO_BA+0x048)  /*!< Host Controller Root Hub Descriptor A Register  */
#define     HcRhDeB         (USBO_BA+0x04C)  /*!< Host Controller Root Hub Descriptor B Register  */
#define     HcRhSts         (USBO_BA+0x050)  /*!< Host Controller Root Hub Status Register        */
#define     HcRhPrt1        (USBO_BA+0x054)  /*!< Host Controller Root Hub Port Status [1]        */
#define     HcRhPrt2        (USBO_BA+0x058)  /*!< Host Controller Root Hub Port Status [2]        */
#define     OpModEn         (USBO_BA+0x204)  /*!< USB Operational Mode Enable Register            */

/**@}*/ /* end of USBH register group */



/*---------------------- USB Device Controller -------------------------*/
/**
    @addtogroup USBD USB Device Controller(USBD)
    Memory Mapped Structure for USBD Controller
@{ */
#define     REG_USBD_GINTSTS        (USBD_BA+0x00)  /*!< Interrupt Status Low Register */
#define     REG_USBD_GINTEN         (USBD_BA+0x08)  /*!< Interrupt Enable Low Register */
#define     REG_USBD_BUSINTSTS      (USBD_BA+0x10)  /*!< USB Bus Interrupt Status Register */
#define     REG_USBD_BUSINTEN       (USBD_BA+0x14)  /*!< USB Bus Interrupt Enable Register */
#define     REG_USBD_OPER           (USBD_BA+0x18)  /*!< USB Operational Register */
#define     REG_USBD_FRAMECNT       (USBD_BA+0x1C)  /*!< USB Frame Count Register */
#define     REG_USBD_FADDR          (USBD_BA+0x20)  /*!< USB Function Address Register */
#define     REG_USBD_TEST           (USBD_BA+0x24)  /*!< USB Test Mode Register */
#define     REG_USBD_CEPDAT         (USBD_BA+0x28)  /*!< Control-ep data buffer register */
#define     REG_USBD_CEPCTL         (USBD_BA+0x2C)  /*!< Control-ep control and status register */
#define     REG_USBD_CEPINTEN       (USBD_BA+0x30)  /*!< Control-ep interrupt enable register */
#define     REG_USBD_CEPINTSTS      (USBD_BA+0x34)  /*!< Control-ep interrupt status register */
#define     REG_USBD_CEPTXCNT       (USBD_BA+0x38)  /*!< In-transfer data count register */
#define     REG_USBD_CEPRXCNT       (USBD_BA+0x3C)  /*!< Out-transfer data count register */
#define     REG_USBD_CEPDATCNT      (USBD_BA+0x40)  /*!< Control-ep data count register */
#define     REG_USBD_SETUP1_0       (USBD_BA+0x44)  /*!< Setup byte1 & byte0 register */
#define     REG_USBD_SETUP3_2       (USBD_BA+0x48)  /*!< Setup byte3 & byte2 register */
#define     REG_USBD_SETUP5_4       (USBD_BA+0x4C)  /*!< Setup byte5 & byte4 register */
#define     REG_USBD_SETUP7_6       (USBD_BA+0x50)  /*!< Setup byte7 & byte6 register */
#define     REG_USBD_CEPBUFSTART    (USBD_BA+0x54)  /*!< Control-ep ram start address register */
#define     REG_USBD_CEPBUFEND      (USBD_BA+0x58)  /*!< Control-ep ram end address register */
#define     REG_USBD_DMACTL         (USBD_BA+0x5C)  /*!< Dma control and status register */
#define     REG_USBD_DMACNT         (USBD_BA+0x60)  /*!< Dma count register */

#define     REG_USBD_EPADAT         (USBD_BA+0x64)  /*!< Endpoint A data buffer register */
#define     REG_USBD_EPAINTSTS      (USBD_BA+0x68)  /*!< Endpoint A interrupt status register */
#define     REG_USBD_EPAINTEN       (USBD_BA+0x6C)  /*!< Endpoint A interrupt enable register */
#define     REG_USBD_EPADATCNT      (USBD_BA+0x70)  /*!< Data count available in endpoint A buffer */
#define     REG_USBD_EPARSPCTL      (USBD_BA+0x74)  /*!< Endpoint A response register set/clear */
#define     REG_USBD_EPAMPS         (USBD_BA+0x78)  /*!< Endpoint A max packet size register */
#define     REG_USBD_EPATXCNT       (USBD_BA+0x7C)  /*!< Endpoint A transfer count register */
#define     REG_USBD_EPACFG         (USBD_BA+0x80)  /*!< Endpoint A configuration register */
#define     REG_USBD_EPABUFSTART    (USBD_BA+0x84)  /*!< Endpoint A ram start address register */
#define     REG_USBD_EPABUFEND      (USBD_BA+0x88)  /*!< Endpoint A ram end address register */

#define     REG_USBD_EPBDAT         (USBD_BA+0x8C)  /*!< Endpoint B data buffer register */
#define     REG_USBD_EPBINTSTS      (USBD_BA+0x90)  /*!< Endpoint B interrupt status register */
#define     REG_USBD_EPBINTEN       (USBD_BA+0x94)  /*!< Endpoint B interrupt enable register */
#define     REG_USBD_EPBDATCNT      (USBD_BA+0x98)  /*!< Data count available in endpoint B buffer */
#define     REG_USBD_EPBRSPCTL      (USBD_BA+0x9C)  /*!< Endpoint B response register set/clear */
#define     REG_USBD_EPBMPS         (USBD_BA+0xA0)  /*!< Endpoint B max packet size register */
#define     REG_USBD_EPBTXCNT       (USBD_BA+0xA4)  /*!< Endpoint B transfer count register */
#define     REG_USBD_EPBCFG         (USBD_BA+0xA8)  /*!< Endpoint B configuration register */
#define     REG_USBD_EPBBUFSTART    (USBD_BA+0xAC)  /*!< Endpoint B ram start address register */
#define     REG_USBD_EPBBUFEND      (USBD_BA+0xB0)  /*!< Endpoint B ram end address register */

